# -*- coding: utf-8 -*-
"""
Created on Wed Dec 19 14:50:16 2018

@author: kwonjiyong
"""


#a = ['a','v','b','c']
#c = ['a','d','s']
#
#num1 = set(a) & set(c)
#num2 = set(a) | set(c)
#
#print(num1)
#print(num2)


#content1 = '环球时报 驻 台北 特约记者 张雯雯 环球时报 记者 白云 怡 波兰 挺 台独 台湾 多家 亲绿 媒体 近日 报道 令 振奋 消息 称 波兰 一家 电视台 节目 支持 台独 环球时报 记者 查阅 发现 这家 所谓 电视台 属于 波兰 主流 媒体 当地 极右翼 团体 意 反潮流 经营 一家 媒体 波兰 驻华 大使馆 日 环球时报 记者 表示 视频 言论 系 个人行为 波兰 始终 坚定 奉行 中国 原则 台湾 亲绿 自由电子 报 日称 近年来 大陆 不断 国际 地位 打压 台湾 地区 不敢 支持 台湾 波兰 电视节目 日前 公开 支持 台湾独立 报道 称 这家 波兰 电视台 节目 开头 找到 讲 中文 波兰 女性 称 波兰人 希望 台湾 能够 独立 中国 说 台湾 说 节目 男 主持人 随后 英语 提到 今年 波兰 独立 周年 波兰 曾 国家 独立 进行 努力 波兰 希望 支持 台湾 对抗 大陆 鼓噪 台湾 宣布 独立 主持人 戴起 一顶 红色 帽子 上面 印有 中国 再次 落败 字样 岛内 台独 分子 如获至宝 称赞 波兰 有种 人 嘲讽 大陆 说 强国 人 崩溃 自由电子 报和三立 新闻台 亲绿 媒体 大肆 报道 声称 波兰 支持 台独 台 行政院长 赖清德 更是 沾沾自喜 日 问及此事 时称 代表 德 孤 必有 邻 波兰 电视台 报道 等于 认同 台湾 主权 独立国家 日 环球时报 记者 此事 波兰 驻华 大使馆 问询 使馆 电邮 回复 称 波兰共和国 年 月 中华人民共和国 正式 建交 最早 新 中国 建交 国家 自此 波兰 政策 始终 坚定 奉行 中国 原则 视频 内容 本身 波兰 驻华使馆 表示 网站 用户 个人行为 不予 评论 记者 发现 绿媒 口中 波兰 电视节目 不入流 极右翼 组织 视频 网站 发布 一段 视频 西方 主流 媒体 组织 十分 厌恶 今年 月 英国 卫报 曾 报道 斥责 极右翼 组织 渗透 英国 传播 极端主义 思想 视频 网站 更是 一度 封杀 账号 想见 组织 波兰 西方 国家 影响力 非常 有限 说 社会 中是 相当 边缘化 分析 认为 这种 攻击 大陆 支持 台独 嗨 节目 居然 台独 分子 当成 宝贝 由此 更能 证明 台独 国际 社会 根本 没什么 朋友 近 一段时间 蔡 英文 当局 国际 频频 发声 西方 媒体 刊登 文章 接受 外媒 采访 动向 值得 警惕 据三立 新闻网 报道 台 外交部长 吴钊燮 日前 接受 南 德意志 报 采访 批评 大陆 利用 种种 外交 手段 逼迫 台湾 外交 导致 台湾 邦交国 断交 吴钊燮 还称 台湾 得到 来自 美国 日本 澳大利亚 英国 德国 支持 台美 关系 目前 过去 好 对此 中国 驻 德国 大使馆 批评 南 德意志 报 采访 吴钊燮 支持 台湾独立 行为 台独 分裂 势力 提供 舞台 违反 中国 原则 '
#contentList1 = content1.strip(' ').split(' ')
#content2 = '参考消息 网 月 日 报道 新媒称 港澳办 副 主任 黄柳权 接受 香港 紫荆 杂志 专访 指出 上个月 月 日 已有 超过 万人 申请 港澳 居民 居住证 当中 有近 万是 香港 人 新加坡 联合早报 网站 月 日 援引 香港电台 报道 黄柳权 承认 居住证 仍 存在 使用 范围 不广 接受程度 不高 问题 中国 内地 公共服务 商业机构 机器 无法 辨识 居住证 相信 进一步 提升 机器 软硬件 仍 需 时间 解释 内地 税务 部门 不会 是否 领取 港澳 居民 居住证 确定 内地 纳税 依据 指出 个人所得税法 修订 落实 时会 考虑 继续 包括 港澳台 境外 人士 优惠 维持 居住 五年 以下 需 全球 收入 纳税 安排 '
#contentList2 = content2.strip(' ').split(' ')
#
#num1 = set(contentList1) & set(contentList2)
#num2 = set(contentList1) | set(contentList2)
#
#print('')

a = ['a','b','c']

b = '\n'.join(a)

print(b)